{"title" : "Nancy Tovar Murals of East L.A. Collection",
"href" : "/viewItem.do?ark=21198/zz001ndq5p",
"thumbName":"",
"browseBy" : [
    {
  "BrowseHref": "/browseContents.do?coreDescTermId=12&selectedProjects=232",
  "BrowseSubj" : "Language"
     },				
     {
  "BrowseHref": "/browseContents.do?coreDescTermId=5&selectedProjects=232",
  "BrowseSubj" : "Personal or Corporate Name"
     },
    {
  "BrowseHref": "/browseContents.do?coreDescTermId=4&selectedProjects=232",
  "BrowseSubj" : "Subject"
     },				
     {
  "BrowseHref": "/browseContents.do?coreDescTermId=9&selectedProjects=232",
  "BrowseSubj" : "Type"
     }
],			
"dataType" : [{"category" : "images"}], 
"description" : "Nancy Van Lauderback Tovar grew up in Chino, CA where she attended local schools for her formative studies, eventually graduating from UCLA. Following graduation, she joined the staff of the Los Angeles graphics powerhouse: Saul Bass Associates, later named Bass/Yaeger. This agency was internationally known for creating iconic logos and packaging for Hollywood's major motion pictures, airlines, telephone, and food industries. After an illustrious 40-year career she retired as Vice President and Director of Production. Ms. Tovar was an active member of the Vestry for the Episcopal Church of the Epiphany located in the Los Angeles neighborhood of Lincoln Heights. She was a creative force organizing classes that produced artistic banners, streamers, posters, and urban photography that reflected the Mexican heritage of the community. As an activist, Ms. Tovar was also a participant and supporter of the 1970 Chicano Moratorium. She wrote several books including: Diary of a Ruko (her husband's journey as a civil rights activist and WWII Veteran), The Parks Family Home in Chino, Tales from the Tovar Garden, as well as journals of her life in the barrio and her personal battle with cancer. Ms. Tovar lost this battle and passed away on March 13, 2010. The photographs in this collection represent her passion for documenting art and life in Los Angeles, and her commitment to the struggle of la Raza. "
},
